#include "mbed.h"
#include "mbed_interface.h"
#include "rt5670_interface.h"
#include "rda_i2s_api.h"
#include "I2C.h"
//#include "I2C.h"


#define LOG_5670(_fmt, ...)  printf("[RT5670] ==> %s(%d): "_fmt"\n", __FILE__, __LINE__, ##__VA_ARGS__)
typedef unsigned short u16;

void wait_1us(int time)
{
	int i = 0; 
	int bound = time * 100;

	for(i = 0; i < bound ; ++i);
}

/**
 * @brief Inite i2s master mode
 *
 * @return
 *     - (-1)  Error
 *     - (0)  Success
 */
i2s_t i2s_obj = {0};
i2s_cfg_t i2s_cfg;

int I2sInit(void)
{
    i2s_cfg.mode              = I2S_MD_MASTER_RX;
    i2s_cfg.rx.fs             = I2S_64FS;
    i2s_cfg.rx.ws_polarity    = I2S_WS_NEG;
    i2s_cfg.rx.std_mode       = I2S_STD_M;
    i2s_cfg.rx.justified_mode = I2S_RIGHT_JM;
    i2s_cfg.rx.data_len       = I2S_DL_16b;
    i2s_cfg.rx.msb_lsb        = I2S_MSB;

    i2s_cfg.tx.fs             = I2S_64FS;
    i2s_cfg.tx.ws_polarity    = I2S_WS_NEG;
    i2s_cfg.tx.std_mode       = I2S_STD_M;
    i2s_cfg.tx.justified_mode = I2S_RIGHT_JM;
    i2s_cfg.tx.data_len       = I2S_DL_16b;
    i2s_cfg.tx.msb_lsb        = I2S_MSB;
    i2s_cfg.tx.wrfifo_cntleft = I2S_WF_CNTLFT_8W;

    //rda_i2s_init(&i2s_obj, I2S_TX_BCLK, I2S_TX_WS, I2S_TX_SD, NC, NC, I2S_RX_SD, GPIO_PIN5);
	rda_i2s_init(&i2s_obj, I2S_TX_BCLK, I2S_TX_WS, I2S_TX_SD, NC, NC, I2S_RX_SD, NC);
    rda_i2s_set_ws(&i2s_obj, 16000, 768);
    rda_i2s_set_tx_channel(&i2s_obj, 1);
    rda_i2s_set_rx_channel(&i2s_obj, 1);
    rda_i2s_format(&i2s_obj, &i2s_cfg);


		//LOG_5670("DSP is busy: %d\n", ret);
		goto err;
	}

	ret = rt5670WriteReg(RT5670_DSP_CTRL2, 0x26);
	if (ret < 0) {
		//LOG_5670("Failed to write DSP addr reg: %d\n", ret);
		goto err;
	}
	dsp_val = RT5670_DSP_DL_1 | RT5670_DSP_CMD_RR | RT5670_DSP_RW_MASK |
		DSP_CLK_RATE | RT5670_DSP_CMD_EN;

	ret = rt5670WriteReg(RT5670_DSP_CTRL1, dsp_val);
	if (ret < 0) {
		//LOG_5670("Failed to write DSP cmd reg: %d\n", ret);
		goto err;
	}

	ret = rt5670_dsp_done();
	if (ret < 0) {
		//LOG_5670("DSP is busy: %d\n", ret);
		goto err;
	}

	ret = rt5670WriteReg(RT5670_DSP_CTRL2, 0x25);
	if (ret < 0) {
		//LOG_5670("Failed to write DSP addr reg: %d\n", ret);
		goto err;
	}

	dsp_val = RT5670_DSP_DL_1 | RT5670_DSP_CMD_RR | RT5670_DSP_RW_MASK |
		DSP_CLK_RATE | RT5670_DSP_CMD_EN;

	ret = rt5670WriteReg(RT5670_DSP_CTRL1, dsp_val);
	if (ret < 0) {
		//LOG_5670("Failed to write DSP cmd reg: %d\n", ret);
		goto err;
	}

	ret = rt5670_dsp_done();
	if (ret < 0) {
		//LOG_5670("DSP is busy: %d\n", ret);
		goto err;
	}

	ret = rt5670ReadReg(RT5670_DSP_CTRL5, pData);
	if (ret < 0) {
		//LOG_5670("Failed to read DSP data reg: %d\n", ret);
		goto err;
	}

	//value = ret;
	//return value;

err:
	return ret;
}

/**
 * @brief Configure RT5670 ADC and DAC volume. Basicly you can consider this as ADC and DAC gain
 *
 * @param mode:             set ADC or DAC or all
 * @param volume:           0 ~ 127              0   : -17.625dB
 *												 47  : 0dB
 *												 127 : +30 dB, with 0.375dB/step
 *
 * @return
 *     - (-1) Parameter error
 *     - (0)   Success
 */
int rt5670SetAdcDacVolume(int mode, int volume)
{
    int res = 0;
    if ( volume < 0 || volume > 127 ) {
        //LOG_5670("Warning: volume < 0! or > 127!\n");
        if (volume < 0)
            volume = 0;
        else
            volume = 127;
    }

    if (mode == RT_MODULE_ADC || mode == RT_MODULE_ADC_DAC) {

		res |= rt5670_update_bits(RT5670_STO1_ADC_DIG_VOL,
									RT5670_ADC_L_VOL_MASK | RT5670_ADC_R_VOL_MASK,
									volume<<RT5670_ADC_L_VOL_SFT | volume);
    }
    if (mode == RT_MODULE_DAC || mode == RT_MODULE_ADC_DAC) {
        /*  ... */
    }
    return res;
}

/**
 * @brief Power Management
 *
 *
 * @return
 *     - (-1)  Error
 *     - (0)   Success
 */
int rt5670Start()
{
	int res = 0;
/*
	res |= rt5670WriteReg(RT5670_PWR_ANLG1, 0xf8fd);
	wait_1us(10000);
	res |= rt5670WriteReg(RT5670_PWR_DIG1, 0x980E);
	//res |= rt5670WriteReg(RT5670_PWR_DIG2, 0xD001);
	res |= rt5670WriteReg(RT5670_PWR_ANLG2, 0xEC74);
*/
	return res;
}
/**
 * @brief Power Management
 *
 * @param mod:      if RT_POWER_CHIP, the whole chip including ADC and DAC is enabled
 * @param enable:   false to disable true to enable
 *
 * @return
 *     - (-1)  Error
 *     - (0)   Success
 */
int rt5670Stop()
{
	int res = 0;
/*
	res |= rt5670WriteReg(RT5670_PWR_DIG1, 0x0000);
	//res |= rt5670WriteReg(RT5670_PWR_DIG2, 0x0001);
	res |= rt5670WriteReg(RT5670_PWR_ANLG1, 0x0005);
	res |= rt5670WriteReg(RT5670_PWR_ANLG2, 0x0000);
*/
	return res;
}

union 
{
	struct
	{	
		u16 Reserved:1;		
		u16 Device_id:2;//		
    u16 Reserved2:13;		
	}databit;
	u16 data16;
}MX_REG_00H;


union 
{
	struct
	{	
		//Right Headphone Channel Volume Control (HPOVOLR)
    //00h: +12dB
    //08: 0dB
    //27h: -46.5dB, with 1.5dB/step
		u16 Vol_hpor:6;		
		u16 Reserved:1;//		
		//Mute Control Right Headphone Output Port (HPOR)
		//0: Un-Mute,1b: Mute
    u16 mu_hpo_r:1;		
		//Left Headphone Channel Volume Control (HPOVOLL);
		//00h: +12dB 08: 0dB,... 27: -46.5dB, with 1.5dB/step
    u16 vol_hpol:6;	
		u16 Reserved2:1;//		
		//Mute Control for Left Headphone Output Port (HPOL)
		//0: Un-Mute,1b: Mute
		u16 mu_hpo_l:1;
	}databit;
	u16 data16;
}MX_REG_02H;

union 
{
	struct
	{
		
		//Right Headphone Channel Volume Control (HPOVOLR)
    //00h: +12dB
    //08: 0dB
    //27h: -46.5dB, with 1.5dB/step
		u16 Vol_outr:6;		
		u16 Reserved:1;//		
		//Mute Control Right Headphone Output Port (HPOR)
		//0: Un-Mute,1b: Mute
    u16 Mu_lout_r:1;		
		//Left Headphone Channel Volume Control (HPOVOLL);
		//00h: +12dB 08: 0dB,... 27: -46.5dB, with 1.5dB/step
    u16 Vol_outl:6;	
		u16 En_dfo1:1;//		
		//Mute Control for Left Headphone Output Port (HPOL)
		//0: Un-Mute,1b: Mute
		u16 Mu_lout_l:1;
	}databit;
	u16 data16;
}MX_REG_03H;


union 
{
	struct
	{	
		u16 Reserved2:2;//1h Reserved	
		//IN1 Port Enable Control
		//0b: Disable
		//1b: Enable		
    u16 En_bst1:1;	
		u16 Reserved:9;//0 Reserved		
		//IN1 Boost Control (BST1)
		//0000b: Bypass
		//0001b: +20dB
		//0010b: +24dB
		//0011b: +30dB
		//0100b: +35dB
		//0101b: +40dB
		//0110b: +44dB
		//0111b: +50dB
		//1000b: +52dB
		//Others : Reserved
		u16 Sel_bst1:4;
	}databit;
	u16 data16;
} MX_REG_0AH;

union 
{
	struct
	{
    //27h Reserved		
		u16 Reserved3:7;//1h Reserved	
		//IN1 Port Mode Control
		//0b: Auto mode
		//1b: Manual mode		
    u16 Reg_mode:1;	
		//0h Reserved
		u16 Reserved2:3;//0 Reserved		
		//Capless Power Gating with IN1 Control
		//0b: Register control
		//1b: Auto mode
		u16 Capless_gat_en:1;		
		//Manual Trigger For IN1 Port
		//0b: Low trigger
		//1b: High trigge
		u16 Manual_tri_in1:1;		
		u16 Reserved:3;//0 Reserved		
	}databit;
	u16 data16;
} MX_REG_0BH;

union 
{
	struct
	{
    //27h Reserved		
		u16 In1_result:3;//1h Reserved	
		//0h Reserved
		u16 Reserved:13;//0 Reserved		
	}databit;
	u16 data16;
} MX_REG_0CH;


union 
{
	struct
	{
    //27h Reserved		
		u16 Reserved3:6;//8h Reserved	
		//Enable IN2 Differential Input
		//0b: Disable (Single-end)
		//1b: Enable (Differential	
    u16 En_in2_df:1;		
		//0h Reserved
		u16 Reserved2:1;//0 Reserved			
		//IN2 Boost Control (BST2)
		//0000b: Bypass
		//0001b: +20dB
		//0010b: +24dB
		//0011b: +30dB
		//0100b: +35dB
		//0101b: +40dB
		//0110b: +44dB
		//0111b: +50dB
		//1000b: +52dB
		//Others : Reserved
		u16 Sel_bst2:4;			
		u16 Reserved:4;//0 Reserved		
	}databit;
	u16 data16;
} MX_REG_0DH;

union 
{
	struct
	{
    //27h Reserved		
		u16 Reserved:12;//0h Reserved	
		//IN3 Boost Control (BST2)
		//0000b: Bypass
		//0001b: +20dB
		//0010b: +24dB
		//0011b: +30dB
		//0100b: +35dB
		//0101b: +40dB
		//0110b: +44dB
		//0111b: +50dB
		//1000b: +52dB
		//Others : Reserved
    u16 Sel_bst3:4;			
	}databit;
	u16 data16;
} MX_REG_0EH;


union 
{
	struct
	{	
		//INR Channel Volume Control ?
		//00h: +12dB
		//08h: 0dB
		//1Fh: -34.5dB, with 1.5dB/step
		u16 Vol_inr:5;//		
		u16 Reserved:3;	//0 Reserved	
		//INL Channel Volume Control ?
		//00h: +12dB
		//08h: 0dB
		//1Fh: -34.5dB, with 1.5dB/step
		u16 Vol_inl:5;					
		u16 Reserved2:3;//0h Reserved		
			
	}databit;
	u16 data16;
} MX_REG_0FH;

union 
{
	struct
	{	
		//DAC1 Right Channel Digital Volume?
		//00h: -65.625dB
		//AFh: 0dB, with 0.375dB/Step		
		u16 vol_dac1_r:8;//0h Reserved		
		//DAC1 Left Channel Digital Volume?
		//00h: -65.625dB
		//AFh: 0dB, with 0.375dB/Step
		u16 vol_dac1_l:8;				
	}databit;
	u16 data16;
} MX_REG_19H;

union 
{
	struct
	{	
		//DAC2 Right Channel Digital Volume?
		//00h: -65.625dB
		//AFh: 0dB, with 0.375dB/Step		
		u16 vol_dac2_r:8;//0h Reserved		
		//DAC2 Left Channel Digital Volume?
		//00h: -65.625dB
		//AFh: 0dB, with 0.375dB/Step
		u16 vol_dac2_l:8;				
	}databit;
	u16 data16;
} MX_REG_1AH;

union 
{
	struct
	{	
		//Select DACR2 Data Source
		//000b: IF1_DAC2_R
		//001b: IF2_DAC_R
		//010b: Reserved
		//011b: TxDC_DAC_R
		//100b: TxDP_DAC_L
		u16 Sel_dacr2:3;//1h Reserved		
		u16 Reserved:1;//0h Reserved		
		//Select DACL2 Data Source
		//000b: IF1_DAC2_L
		//001b: IF2_DAC_L
		//010b: Reserved
		//011b: TxDC_DAC_L
		//100b: Reserved
		//101b: VAD_ADC or TxDP_ADC_R		
		u16 Sel_dacl2:3;//1h Reserved		
		u16 Reserved2:5;//0h Reserved
		//Mute Control for Right DAC2 Volume
		//0b: Un-Mute
		//1b: Mute		
		u16 Mu_dac2_r:1;//1h Reserved				
		//DAC2 Left Channel Digital Volume?
		//00h: -65.625dB
		//AFh: 0dB, with 0.375dB/Step	
		//Mute Control for Right DAC2 Volume
		//0b: Un-Mute
		//1b: Mute		
		u16 Mu_dac2_l:1;//1h Reserved				
		u16 Reserved3:2;//0h Reserved			
	}databit;
	u16 data16;
} MX_REG_1BH;


union 
{
	struct
	{	
		//Stereo1 ADC Right Channel Volume Control
		//00h: -17.625dB
		//2Fh: 0dB
		//7Fh: +30dB, with 0.375dB/Step			
		u16 Ad_gain_r:7;//2Fh Reserved	
		//Mute Control for Stereo1 ADC Right Volume Channel
		//0b: Un-Mute
		//1b: Mute	
		u16 Mu_adc_vol_r:1;//1h Reserved		
		//Stereo1 ADC Left Channel Volume Control
		//00h: -17.625dB
		//2Fh: 0dB
		//7Fh: +30dB, with 0.375dB/Step	
		u16 Ad_gain_l:7;//2Fh Reserved		
		//Mute Control for Stereo1 ADC Left Volume Channel
		//0b: Un-Mute
		//1b: Mute		
		u16 Mu_adc_vol_l:1;//0h Reserved				
	}databit;
	u16 data16;
} MX_REG_1CH;

union 
{
	struct
	{	
		//Stereo1 ADC Right Channel Volume Control
		//00h: -17.625dB
		//2Fh: 0dB
		//7Fh: +30dB, with 0.375dB/Step			
		u16 Mono_ad_gain_r:7;//2Fh Reserved	
		//Mute Control for Stereo1 ADC Right Volume Channel
		//0b: Un-Mute
		//1b: Mute	
		u16 reserved:1;//0h Reserved		
		//Stereo1 ADC Left Channel Volume Control
		//00h: -17.625dB
		//2Fh: 0dB
		//7Fh: +30dB, with 0.375dB/Step	
		u16 Mono_ad_gain_l:7;//2Fh Reserved		
		//Mute Control for Stereo1 ADC Left Volume Channel
		//0b: Un-Mute
		//1b: Mute		
		u16 reserved2:1;//0h Reserved				
	}databit;
	u16 data16;
} MX_REG_1DH;	

union 
{
	struct
	{			
		u16 reserved:4;//0h Reserved	
		//Stereo2 ADC Compensation Gain
		//00b: 0dB
		//01b: 1dB
		//10b: 2dB
		//11b: 3dB
		u16 Stereo2_ad_comp_gain:2;//0h Reserved		
		//Stereo2 ADC Right Channel Digital Boost Gain
		//00b: 0dB
		//01b: 12dB
		//10b: 24dB
		//11b: 36dB
		u16 Stereo2_ad_boost_gain_r:2;//0h Reserved	
		//Stereo2 ADC Left Channel Digital Boost Gain
		//00b: 0dB
		//01b: 12dB
		//10b: 24dB
		//11b: 36d		
		u16 Stereo2_ad_boost_gain_l:2;//0h Reserved		
		//Stereo1 ADC Compensation Gain
		//00b: 0dB
		//01b: 1dB
		//10b: 2dB
		//11b: 3dB
		u16 Stereo1_ad_comp_gain:2;//0h Reserved	
		//Stereo1 ADC Right Channel Digital Boost Gain
		//00b: 0dB
		//01b: 12dB
		//10b: 24dB
		//11b: 36dB		
		u16 Stereo1_ad_boost_gain_r:2;//0h Reserved		
		//Stereo1 ADC Left Channel Digital Boost Gain
		//00b: 0dB
		//01b: 12dB
		//10b: 24dB
		//11b: 36dB		
		u16 Stereo1_ad_boost_gain_l:2;//0h Reserved				

	}databit;
	u16 data16;
} MX_REG_1EH;


union 
{
	struct
	{
		//Stereo2 ADC Right Channel Volume Control
		//00h: -17.625dB
		//2Fh: 0dB
		//7Fh: +30dB, with 0.375dB/Step		
		u16 Ad2_gain_r:7;//2Fh Reserved	
		
		//Mute Control for Stereo2 ADC Right Volume Channel
		//0b: Un-Mute
		//1b: Mute
		u16 Mu_adc2_vol_r:1;//0h Reserved		
		
		//Stereo2 ADC Left Channel Volume Control
		//00h: -17.625dB
		//2Fh: 0dB
		//7Fh: +30dB, with 0.375dB/Step		
		u16 Ad2_gain_l:7;//2Fh Reserved	
		
		//Mute Control for Stereo2 ADC Left Volume Channel
		//0b: Un-Mute
		//1b: Mute	
		u16 Mu_adc2_vol_l:1;//0h Reserved		
		
	}databit;
	u16 data16;
} MX_REG_1FH;


union 
{
	struct
	{
		//Stereo2 ADC Right Channel Volume Control
		//00h: -17.625dB
		//2Fh: 0dB
		//7Fh: +30dB, with 0.375dB/Step		
		u16 Reserved:10;//0h Reserved	
		
		//Mono ADC Compensation Gain
		//00b: 0dB
		//01b: 1dB
		//10b: 2dB
		//11b: 3dB
		u16 mono_ad_comp_gain:2;//0h Reserved		
		
		//Mono ADC Right Channel Digital Boost Gain
		//00b: 0dB
		//01b: 12dB
		//10b: 24dB
		//11b: 36dB	
		u16 mono_ad_boost_gain_r:2;//2Fh Reserved	
		
		//Mono ADC Left Channel Digital Boost Gain
		//00b: 0dB
		//01b: 12dB
		//10b: 24dB
		//11b: 36dB
		u16 mono_ad_boost_gain_l:2;//0h Reserved		
		
	}databit;
	u16 data16;
} MX_REG_20H;

union 
{
	struct
	{
		u16 reserved:5;//0h Reserved	
		u16 mu_stereo2_adcr2:1;//0h Reserved		
		u16 mu_stereo2_adcr1:1;//2Fh Reserved		
		u16 reserved2:1;//0h Reserved		
		u16 Sel_stereo2_dmic:2;//0h Reserved	
		u16 Sel_stereo2_adc:1;//0h Reserved		
		u16 sel_stereo2_adc2:1;//2Fh Reserved		
		u16 sel_stereo2_adc1:1;//0h Reserved				
		u16 mu_stereo2_adcl2:1;//0h Reserved		
		u16 mu_stereo2_adcl1:1;//0h Reserved	
		u16 Sel_stereo2_lr_mix:1;//0h Reserved			
			
	}databit;
	u16 data16;
} MX_REG_26H;

union 
{
	struct
	{
		u16 Sel_dmic3_data:1;//0h Reserved			
		u16 reserved:4;//2Fh Reserved		
		u16 mu_stereo1_adcr2:1;//0h Reserved		
		u16 mu_stereo1_adcr1:1;//0h Reserved			
		u16 reserved2:1;//0h Reserved		
		u16 Sel_stereo1_dmic:2;//2Fh Reserved		
		u16 Sel_stereo1_adc:1;//0h Reserved			
		u16 sel_stereo1_adc2:1;//0h Reserved		
		u16 sel_stereo1_adc1:1;//0h Reserved	
		u16 mu_stereo1_adcl2:1;//0h Reserved			
		u16 mu_stereo1_adcl1:1;//0h Reserved	
		u16 reserved3:1;//0h Reserved			
	}databit;
	u16 data16;
} MX_REG_27H;

union 
{
	struct
	{
		u16 Sel_mono_dmic_r:2;// 			
		u16 sel_mono_adc_r:1;// 		
		u16 sel_mono_adcr2:1;// 			
		u16 sel_mono_adcr1:1;// 	
		u16 mu_mono_adcr2:1;// 		
		u16 mu_mono_adcr1:1;// 		
		u16 Reserved:1;// 					
		u16 Sel_mono_dmic_l:2;// 		
		u16 sel_mono_adc_l:1;// 	
		u16 sel_mono_adcl2:1;// 			
		u16 sel_mono_adcl1:1;// 	
		u16 mu_mono_adcl2:1;// 			
		u16 mu_mono_adcl1:1;// 	
		u16 reserved:1;// 		
	}databit;
	u16 data16;
} MX_REG_28H;



union 
{
	struct
	{
		u16 reserved:6;//0h Reserved			
		//Mute Source1 to Stereo2 ADC Right Channel
		//0b:UnMute
		//1b:Mute	
		u16 Mu_dac1_r:1;//2Fh Reserved	
		
		u16 Mu_stereo1_adc_mixer_r:1;//0h Reserved	

		//Select Stereo2 DMIC Source
		//00b: DMIC1
		//01b: DMIC2
		//10b: DMIC3
		//11b: Reserved		
		u16 Sel_dacl1:2;//0h Reserved	
		
		//Select Stereo2 ADC Filter Source
		//0b: ADC1 => Left channel
		//ADC2 => Right channel
		//1b: ADC3 => Left channel
		//ADC3 => Right channel
		u16 Sel_dacr1:2;//0h Reserved		
		
		//Select Stereo2 ADC L/R Channel Source 2
		//0b: DAC_MIXL / DAC_MIXR
		//1b: DMIC1/DMIC2/DMIC3
		u16 reserved2:2;//2Fh Reserved	
		//Select Stereo2 ADC L/R Channel Source 1
		//0b: DAC_MIXL / DAC_MIXR
		//1b: ADC1		
		u16 Mu_dac1_l:1;//0h Reserved			
		//Mute Source2 to Stereo2 ADC Left Channel
		//0b:UnMute
		//1b:Mute		
		u16 Mu_stereo1_adc_mixer_l:1;//0h Reserved	
		


	}databit;
	u16 data16;
} MX_REG_29H;




union 
{
	struct
	{
		u16 gain_dacl1_to_stereo_r:1;//0h Reserved			
		//Mute Source1 to Stereo2 ADC Right Channel
		//0b:UnMute
		//1b:Mute	
		u16 mu_stereo_dacl1_mixr:1;//2Fh Reserved	
		
		u16 Mu_snc_to_dac_r:1;//0h Reserved	

		//Select Stereo2 DMIC Source
		//00b: DMIC1
		//01b: DMIC2
		//10b: DMIC3
		//11b: Reserved		
		u16 gain_dacr2_to_stereo_r:1;//0h Reserved	
		
		//Select Stereo2 ADC Filter Source
		//0b: ADC1 => Left channel
		//ADC2 => Right channel
		//1b: ADC3 => Left channel
		//ADC3 => Right channel
		u16 mu_stereo_dacr2_mixr:1;//0h Reserved		
		
		//Select Stereo2 ADC L/R Channel Source 2
		//0b: DAC_MIXL / DAC_MIXR
		//1b: DMIC1/DMIC2/DMIC3
		u16 gain_dacr1_to_stereo_r:1;//2Fh Reserved	
		//Select Stereo2 ADC L/R Channel Source 1
		//0b: DAC_MIXL / DAC_MIXR
		//1b: ADC1		
		u16 mu_stereo_dacr1_mixr:1;//0h Reserved			
		//Mute Source2 to Stereo2 ADC Left Channel
		//0b:UnMute
		//1b:Mute		
		u16 reserved:1;//0h Reserved	
		//Mute Source1 to Stereo2 ADC Left Channel
		//0b:UnMute
		//1b:Mute		
		u16 gain_dacr1_to_stereo_l:1;//0h Reserved
		//Mixing Control for Stereo2 ADC Left channel
		//0b: L
		//1b: L+R		
		u16 mu_stereo_dacr1_mixl:1;//0h Reserved			

			
		u16 Mu_snc_to_dac_l:1;//0h Reserved	
		u16 gain_dacl2_to_stereo_l:1;//0h Reserved		

		u16 mu_stereo_dacl2_mixl:1;//0h Reserved	
		u16 gain_dacl1_to_stereo_l:1;//0h Reserved			

		u16 mu_stereo_dacl1_mixl:1;//0h Reserved	
		u16 reserved2:1;//0h Reserved	

	}databit;
	u16 data16;
} MX_REG_2AH;

union 
{
	struct
	{
		u16 reserved:1;//0h Reserved			
		//Mute Source1 to Stereo2 ADC Right Channel
		//0b:UnMute
		//1b:Mute	
		u16 gain_mono_r_dacl2:1;//2Fh Reserved	
		
		u16 mu_mono_dacl2_mixr:1;//0h Reserved	

		//Select Stereo2 DMIC Source
		//00b: DMIC1
		//01b: DMIC2
		//10b: DMIC3
		//11b: Reserved		
		u16 gain_mono_r_dacr2:1;//0h Reserved	
		
		//Select Stereo2 ADC Filter Source
		//0b: ADC1 => Left channel
		//ADC2 => Right channel
		//1b: ADC3 => Left channel
		//ADC3 => Right channel
		u16 mu_mono_dacr2_mixr:1;//0h Reserved		
		
		//Select Stereo2 ADC L/R Channel Source 2
		//0b: DAC_MIXL / DAC_MIXR
		//1b: DMIC1/DMIC2/DMIC3
		u16 gain_mono_r_dacr1:1;//2Fh Reserved	
		//Select Stereo2 ADC L/R Channel Source 1
		//0b: DAC_MIXL / DAC_MIXR
		//1b: ADC1		
		u16 mu_mono_dacr1_mixr:1;//0h Reserved			
		//Mute Source2 to Stereo2 ADC Left Channel
		//0b:UnMute
		//1b:Mute		
		u16 reserved2:2;//0h Reserved	
		//Mute Source1 to Stereo2 ADC Left Channel
		//0b:UnMute
		//1b:Mute		
		u16 gain_mono_l_dacr2:1;//0h Reserved
		//Mixing Control for Stereo2 ADC Left channel
		//0b: L
		//1b: L+R		
		u16 mu_mono_dacr2_mixl:1;//0h Reserved			
		
		u16 gain_mono_l_dacl2:1;//0h Reserved	
		u16 mu_mono_dacl2_mixl:1;//0h Reserved		

		u16 gain_mono_l_dacl1:1;//0h Reserved	
		u16 mu_mono_dacl1_mixl:1;//0h Reserved			

		u16 reserved3:1;//0h Reserved	

	}databit;
	u16 data16;
} MX_REG_2BH;




union 
{
	struct
	{
		u16 reserved:4;//0h Reserved			
		//Mute Source1 to Stereo2 ADC Right Channel
		//0b:UnMute
		//1b:Mute	
		u16 gain_dacl2_to_dacmixr:1;//2Fh Reserved	
		
		u16 Mu_dacl2_to_dacmixr:1;//0h Reserved	

		//Select Stereo2 DMIC Source
		//00b: DMIC1
		//01b: DMIC2
		//10b: DMIC3
		//11b: Reserved		
		u16 gain_dacr2_to_dacmixl:1;//0h Reserved	
		
		//Select Stereo2 ADC Filter Source
		//0b: ADC1 => Left channel
		//ADC2 => Right channel
		//1b: ADC3 => Left channel
		//ADC3 => Right channel
		u16 Mu_dacr2_to_dacmixl:1;//0h Reserved		
		
		//Select Stereo2 ADC L/R Channel Source 2
		//0b: DAC_MIXL / DAC_MIXR
		//1b: DMIC1/DMIC2/DMIC3
		u16 gain_dacr2_to_dacmixr:1;//2Fh Reserved	
		//Select Stereo2 ADC L/R Channel Source 1
		//0b: DAC_MIXL / DAC_MIXR
		//1b: ADC1		
		u16 Mu_dacr2_to_dacmixr:1;//0h Reserved			
		//Mute Source2 to Stereo2 ADC Left Channel
		//0b:UnMute
		//1b:Mute		
		u16 gain_stereomixr_to_dacmixr:1;//0h Reserved	
		//Mute Source1 to Stereo2 ADC Left Channel
		//0b:UnMute
		//1b:Mute		
		u16 Mu_stereomixr_to_dacmixr:1;//0h Reserved
		//Mixing Control for Stereo2 ADC Left channel
		//0b: L
		//1b: L+R		
		u16 gain_dacl2_to_dacmixl:1;//0h Reserved					
		u16 Mu_dacl2_to_dacmixl:1;//0h Reserved	
		
		u16 gain_stereomixl_to_dacmixl:1;//0h Reserved		
		u16 Mu_stereomixl_to_dacmixl:1;//0h Reserved	

	}databit;
	u16 data16;
} MX_REG_2CH;

union 
{
	struct
	{
		u16 Sel_dsp_dl_bypass:1;//0h Reserved			
		//Mute Source1 to Stereo2 ADC Right Channel
		//0b:UnMute
		//1b:Mute	
		u16 Sel_dsp_ul_bypass:1;//2Fh Reserved	
		
		u16 Sel_tdm_txdp_slot:2;//0h Reserved	

		//Select Stereo2 DMIC Source
		//00b: DMIC1
		//01b: DMIC2
		//10b: DMIC3
		//11b: Reserved		
		u16 Sel_src_to_txdp:2;//0h Reserved	
		
		//Select Stereo2 ADC Filter Source
		//0b: ADC1 => Left channel
		//ADC2 => Right channel
		//1b: ADC3 => Left channel
		//ADC3 => Right channel
		u16 Sel_txdc_data:2;//0h Reserved		
		
		//Select Stereo2 ADC L/R Channel Source 2
		//0b: DAC_MIXL / DAC_MIXR
		//1b: DMIC1/DMIC2/DMIC3
		u16 Sel_txdp_data:2;//2Fh Reserved	
		//Select Stereo2 ADC L/R Channel Source 1
		//0b: DAC_MIXL / DAC_MIXR
		//1b: ADC1		
		u16 Reserved:1;//0h Reserved			
		//Mute Source2 to Stereo2 ADC Left Channel
		//0b:UnMute
		//1b:Mute		
		u16 Sel_src_to_rxdp:2;//0h Reserved	
		//Mute Source1 to Stereo2 ADC Left Channel
		//0b:UnMute
		//1b:Mute		
		u16 Sel_rxdp_in:3;//0h Reserved
	}databit;
	u16 data16;
} MX_REG_2DH;


union 
{
	struct
	{
		u16 Vol_txdp_r:7;//0h Reserved			
		//Mute Source1 to Stereo2 ADC Right Channel
		//0b:UnMute
		//1b:Mute	
		u16 Reserved:1;//2Fh Reserved	
		
		u16 Vol_txdp_l:7;//0h Reserved	

		//Select Stereo2 DMIC Source
		//00b: DMIC1
		//01b: DMIC2
		//10b: DMIC3
		//11b: Reserved		
		u16 Reserved2:1;//0h Reserved	
	}databit;
	u16 data16;
} MX_REG_2EH;

union 
{
	struct
	{
		u16 Sel_if3_adc_data_in:3;//0h Reserved			
		u16 Reserved:1;//2Fh Reserved		
		u16 sel_if3_adc_data:2;//0h Reserved		
		u16 sel_if3_dac_data:2;//0h Reserved	
		u16 sel_if2_adc_data:2;//0h Reserved	
		u16 sel_if2_dac_data:2;//0h Reserved			
		u16 Sel_if2_adc_data_in:3;//0h Reserved	
		u16 Sel_if1_adc2_data_in:1;//0h Reserved		
	}databit;
	u16 data16;
} MX_REG_2FH;

union 
{
	struct
	{
		u16 Reserved:4;//0h Reserved			
		u16 Gain_pdm_in:1;//2Fh Reserved		
		u16 Sel_pdm_pattern_ctrl:1;//0h Reserved		
		u16 reserved:2;//0h Reserved	
		
		u16 mu_pdm2_r:1;//0h Reserved	
		u16 sel_pdm2_r:1;//0h Reserved			
		u16 mu_pdm2_l:1;//0h Reserved	
		u16 sel_pdm2_l:1;//0h Reserved
		u16 reserved2:4;//0h Reserved	
		
	}databit;
	u16 data16;
} MX_REG_31H;


union 
{
	struct
	{
		u16 Reserved:3;//0h Reserved			
		u16 Pdm2_cmd_exe:1;//2Fh Reserved		
		u16 Reserved2:12;//0h Reserved	
		
	}databit;
	u16 data16;
} MX_REG_32H;

union 
{
	struct
	{
		u16 Pdm2_cmd_pattern:8;//0h Reserved			
		u16 Reserved:8;//2Fh Reserved			
	}databit;
	u16 data16;
} MX_REG_35H;

union 
{
	struct
	{
		u16 reserved:1;//			
		u16 gain_bst2_recmixl:3;//	

		u16 gain_bst3_recmixl:3;//
		u16 reserved2:3;//
		u16 gain_inl_recmixl:3;//						
		u16 reserved3:3;//	
		
	}databit;
	u16 data16;
} MX_REG_3BH;

union 
{
	struct
	{
		u16 reserved:1;//			
		u16 Mu_bst1_recmixl:1;//	
		u16 Mu_bst2_recmixl:1;//
		u16 Mu_bst3_recmixl:1;//
		u16 reserved2:1;//						
		u16 Mu_inl_recmixl:1;//	
		u16 reserved3:7;//						
		u16 gain_bst1_recmixl:3;//		
	}databit;
	u16 data16;
} MX_REG_3CH;


union 
{
	struct
	{
		u16 reserved:1;//			
		u16 gain_bst2_recmixr:3;//	
		u16 gain_bst3_recmixr:3;//
		u16 reserved2:3;//
		u16 gain_inr_recmixr:3;//						
		u16 reserved3:3;//			
	}databit;
	u16 data16;
} MX_REG_3DH;

union 
{
	struct
	{
		u16 reserved:1;//			
		u16 Mu_bst1_recmixr:1;//	
		u16 Mu_bst2_recmixr:1;//
		u16 Mu_bst3_recmixr:1;//
		u16 reserved2:1;//			
		u16 Mu_inr_recmixr:1;//		
		
		u16 reserved3:7;//	
